In [15]:
import pandas as pd

In [16]:
df = pd.read_csv("emp.csv")

In [22]:
#Fetch the data from row number 2 or index = 1
df.iloc[1]

eno                     102
ename            Jane Smith
dateofjoining    2019-08-25
Name: 1, dtype: object

In [24]:
#Fetch a specific ename
df['ename'].iloc[1]

'Jane Smith'

   eno          ename dateofjoining
0  101       John Doe    2020-03-12
1  102     Jane Smith    2019-08-25
2  103     Mark Brown    2021-01-15
3  104    Emily Davis    2018-11-20
4  105  Chris Johnson    2022-06-18
5  106     Lily White    2020-09-10
6  107      James Lee    2021-02-22
7  108    Anna Wilson    2017-04-05
8  109  Michael Clark    2023-05-30
9  110   Susan Taylor    2019-12-09

In [26]:
# Fetch only required columns from the file and store in dataframe
df = pd.read_csv("emp.csv",usecols=['eno','dateofjoining'])

In [28]:
# to mark eno as a index column
df = pd.read_csv("emp.csv",index_col='eno')

In [46]:
df = pd.read_csv("emp.csv")

In [47]:
df.dtypes

eno               int64
ename            object
dateofjoining    object
dtype: object

In [48]:
# convert the eno datatype from int to float
df = pd.read_csv("emp.csv",dtype={'eno':float})

In [49]:
df.dtypes

eno              float64
ename             object
dateofjoining     object
dtype: object

In [51]:
df

     eno          ename dateofjoining
0  101.0       John Doe    2020-03-12
1  102.0     Jane Smith    2019-08-25
2  103.0     Mark Brown    2021-01-15
3  104.0    Emily Davis    2018-11-20
4  105.0  Chris Johnson    2022-06-18
5  106.0     Lily White    2020-09-10
6  107.0      James Lee    2021-02-22
7  108.0    Anna Wilson    2017-04-05
8  109.0  Michael Clark    2023-05-30
9  110.0   Susan Taylor    2019-12-09

In [52]:
df = pd.read_csv("emp.csv")

In [53]:
df

    eno          ename dateofjoining
0   101       John Doe    2020-03-12
1   102     Jane Smith    2019-08-25
2   103     Mark Brown    2021-01-15
3   104    Emily Davis    2018-11-20
4   105  Chris Johnson    2022-06-18
..  ...            ...           ...
60  106     Lily White    2020-09-10
61  107      James Lee    2021-02-22
62  108    Anna Wilson    2017-04-05
63  109  Michael Clark    2023-05-30
64  110   Susan Taylor    2019-12-09

[65 rows x 3 columns]

In [57]:
# read the file in chunk ( smaller set of data)
chunkno= 1
for chunk in pd.read_csv('emp.csv',chunksize=5):
    print(chunkno,":  ",chunk)
    chunkno = chunkno+1

1 :      eno          ename dateofjoining
0  101       John Doe    2020-03-12
1  102     Jane Smith    2019-08-25
2  103     Mark Brown    2021-01-15
3  104    Emily Davis    2018-11-20
4  105  Chris Johnson    2022-06-18
2 :      eno          ename dateofjoining
5  106     Lily White    2020-09-10
6  107      James Lee    2021-02-22
7  108    Anna Wilson    2017-04-05
8  109  Michael Clark    2023-05-30
9  110   Susan Taylor    2019-12-09
3 :       eno        ename  dateofjoining
10  eno        ename  dateofjoining
11  101     John Doe     2020-03-12
12  102   Jane Smith     2019-08-25
13  103   Mark Brown     2021-01-15
14  104  Emily Davis     2018-11-20
4 :       eno          ename dateofjoining
15  105  Chris Johnson    2022-06-18
16  106     Lily White    2020-09-10
17  107      James Lee    2021-02-22
18  108    Anna Wilson    2017-04-05
19  109  Michael Clark    2023-05-30
5 :       eno         ename  dateofjoining
20  110  Susan Taylor     2019-12-09
21  eno         ename  dateofjoining
22  101      John Doe     2020-03-12
23  102    Jane Smith     2019-08-25
24  103    Mark Brown     2021-01-15
6 :       eno          ename dateofjoining
25  104    Emily Davis    2018-11-20
26  105  Chris Johnson    2022-06-18
27  106     Lily White    2020-09-10
28  107      James Lee    2021-02-22
29  108    Anna Wilson    2017-04-05
7 :       eno          ename  dateofjoining
30  109  Michael Clark     2023-05-30
31  110   Susan Taylor     2019-12-09
32  eno          ename  dateofjoining
33  101       John Doe     2020-03-12
34  102     Jane Smith     2019-08-25
8 :       eno          ename dateofjoining
35  103     Mark Brown    2021-01-15
36  104    Emily Davis    2018-11-20
37  105  Chris Johnson    2022-06-18
38  106     Lily White    2020-09-10
39  107      James Lee    2021-02-22
9 :       eno          ename  dateofjoining
40  108    Anna Wilson     2017-04-05
41  109  Michael Clark     2023-05-30
42  110   Susan Taylor     2019-12-09
43  eno          ename  dateofjoining
44  101       John Doe     2020-03-12
10 :       eno          ename dateofjoining
45  102     Jane Smith    2019-08-25
46  103     Mark Brown    2021-01-15
47  104    Emily Davis    2018-11-20
48  105  Chris Johnson    2022-06-18
49  106     Lily White    2020-09-10
11 :       eno          ename  dateofjoining
50  107      James Lee     2021-02-22
51  108    Anna Wilson     2017-04-05
52  109  Michael Clark     2023-05-30
53  110   Susan Taylor     2019-12-09
54  eno          ename  dateofjoining
12 :       eno          ename dateofjoining
55  101       John Doe    2020-03-12
56  102     Jane Smith    2019-08-25
57  103     Mark Brown    2021-01-15
58  104    Emily Davis    2018-11-20
59  105  Chris Johnson    2022-06-18
13 :       eno          ename dateofjoining
60  106     Lily White    2020-09-10
61  107      James Lee    2021-02-22
62  108    Anna Wilson    2017-04-05
63  109  Michael Clark    2023-05-30
64  110   Susan Taylor    2019-12-09

In [70]:
# read rows from 6 to 8 and store in to dataframe
df = pd.read_csv('emp.csv',skiprows=5,nrows=3)

In [73]:
df.dtypes

eno               int64
ename            object
dateofjoining    object
dtype: object

In [75]:
df = pd.read_csv('emp.csv',parse_dates=['dateofjoining'])

In [76]:
df.dtypes

eno                       int64
ename                    object
dateofjoining    datetime64[ns]
dtype: object

In [79]:
df['dateofjoining'].dt.month

0     3
1     8
2     1
3    11
4     6
5     9
6     2
7     4
8     5
9    12
Name: dateofjoining, dtype: int32

In [80]:
df = pd.read_csv('emp.csv',low_memory=False)

In [81]:
df = pd.read_csv('emp.csv',low_memory=False)

In [82]:
df

   eno          ename dateofjoining
0  101       John Doe    2020-03-12
1  102     Jane Smith    2019-08-25
2  103     Mark Brown    2021-01-15
3  104    Emily Davis    2018-11-20
4  105  Chris Johnson    2022-06-18
5  106     Lily White    2020-09-10
6  107      James Lee    2021-02-22
7  108    Anna Wilson    2017-04-05
8  109  Michael Clark    2023-05-30
9  110   Susan Taylor    2019-12-09

In [85]:
df.to_csv('tgt_emp.csv',index=False)

In [86]:
emp = {'eno':[1,2,3],'ename':['Rakesh','Pankaj','Mayank']}

In [87]:
emp

{'eno': [1, 2, 3], 'ename': ['Rakesh', 'Pankaj', 'Mayank']}

In [89]:
df = pd.DataFrame(emp)

   eno   ename
0    1  Rakesh
1    2  Pankaj
2    3  Mayank

In [95]:
for df in pd.read_csv('emp.csv',chunksize=2):
    print(df)
    df.to_csv('checkFile.csv',mode='a',index=False)

   eno       ename dateofjoining
0  101    John Doe    2020-03-12
1  102  Jane Smith    2019-08-25
   eno        ename dateofjoining
2  103   Mark Brown    2021-01-15
3  104  Emily Davis    2018-11-20
   eno          ename dateofjoining
4  105  Chris Johnson    2022-06-18
5  106     Lily White    2020-09-10
   eno        ename dateofjoining
6  107    James Lee    2021-02-22
7  108  Anna Wilson    2017-04-05
   eno          ename dateofjoining
8  109  Michael Clark    2023-05-30
9  110   Susan Taylor    2019-12-09